In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
dataset = pd.read_excel("dummy_users.xlsx")
dataset.head(5)

,id,name,role,salary,age,gender,alive,department,alone,phone_number,city,state,single
0,1,Margaret Moore,Developer,57887,25,Male,No,Operations,No,(254)682-1008x497,Chicago,TX,Yes
1,2,Johnny Mcdowell,Designer,108087,43,Male,No,Finance,No,713.998.3327x6460,Houston,CA,No
2,3,Elizabeth Miller,Manager,68709,42,Female,No,HR,Yes,001-823-068-8392x5295,Los Angeles,CA,Yes
3,4,Lydia Baldwin,Designer,92735,59,Female,No,Operations,No,353-149-4250x81413,Los Angeles,NY,Yes
4,5,John Mccoy,QA,95393,49,Male,No,HR,Yes,(270)652-6399,New York,IL,Yes

In [ ]:
en_data = dataset[["gender"]]
en_data

    gender
0     Male
1     Male
2   Female
3   Female
4     Male
5     Male
6     Male
7   Female
8   Female
9     Male
10  Female
11    Male
12    Male
13    Male
14  Female
15  Female
16    Male
17    Male
18  Female
19    Male

In [5]:
pd.get_dummies(en_data)

    gender_Female  gender_Male
0           False         True
1           False         True
2            True        False
3            True        False
4           False         True
5           False         True
6           False         True
7            True        False
8            True        False
9           False         True
10           True        False
11          False         True
12          False         True
13          False         True
14           True        False
15           True        False
16          False         True
17          False         True
18           True        False
19          False         True

In [6]:
from sklearn.preprocessing import OneHotEncoder

In [8]:
ohe = OneHotEncoder()
ar = ohe.fit_transform(en_data).toarray()

In [9]:
pd.DataFrame(ar, columns=["gender_Female", "gender_Male"])

    gender_Female  gender_Male
0             0.0          1.0
1             0.0          1.0
2             1.0          0.0
3             1.0          0.0
4             0.0          1.0
5             0.0          1.0
6             0.0          1.0
7             1.0          0.0
8             1.0          0.0
9             0.0          1.0
10            1.0          0.0
11            0.0          1.0
12            0.0          1.0
13            0.0          1.0
14            1.0          0.0
15            1.0          0.0
16            0.0          1.0
17            0.0          1.0
18            1.0          0.0
19            0.0          1.0